import random
v = int(0)
p = int(0)
s = int(0)
print('โปรแกรมเป่ายิงฉุบ')
while True:
    a = random.choice(["ค้อน","กรรไกร","กระดาษ"])
    print(a)
    print('เลือก ค้อน กรรไกร กระดาษ')
    i = str(input("คุณเลือก : "))
    if i == a :
        print("ผลลัพธ์คือ เสมอ")
        s += 1
        print('-----------------------------')
    elif a == "กรรไกร" and i == "ค้อน" :
        print("ผลลัพธ์คือ คุณชนะ")
        v += 1
        print('-----------------------------')
    elif a == "ค้อน" and i == "กระดาษ" :
        print("ผลลัพธ์คือ คุณชนะ")
        v += 1
        print('-----------------------------')
    elif a == "กระดาษ" and i == "กรรไกร" :
        print("ผลลัพธ์คือ คุณชนะ")
        v += 1
        print('-----------------------------')
    else :
        print("ผลลัพธ์คือ คุณแพ้")
        p += 1
        print('-----------------------------')
        